# EnergyAnalysisSpace Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisSpace Class
Members See Also
---
Analytical space.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class EnergyAnalysisSpace : Element
```

Visual Basic
---
```text
Public Class EnergyAnalysisSpace _
	Inherits Element
```

Visual C++
---
```text
public ref class EnergyAnalysisSpace : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.Analysis..::..EnergyAnalysisSpace
# See Also
EnergyAnalysisSpace Members
Autodesk.Revit.DB.Analysis Namespace